templates/044C.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:v01="urn:http://brz.gv.at/ezoll/V01">
    <soapenv:Header/>
    <soapenv:Body>
        <v01:sendMessages>
            <arrayOfTransitRequestBean_1>
                <id>1</id>
                <message><![CDATA[<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<ns2:Msg xmlns:ns2="http://brz.gv.at/ezoll/V01" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<ns2:MsgSdr>swp.transit.agent</ns2:MsgSdr>
<ns2:MsgRcp>NTA.AT</ns2:MsgRcp>
<ns2:PrepDT>{{object.PrepDT}}</ns2:PrepDT>
<ns2:ICRef>{{object.ICRef}}</ns2:ICRef>
<ns2:Appl>acc</ns2:Appl>
<ns2:Test>1</ns2:Test>
<ns2:MsgTyp>CC044C</ns2:MsgTyp>
<!--_______________________________________End of AT Header_________________________________________-->

<ns4:CC044C xmlns:ns4="http://ncts.dgtaxud.ec" xmlns:ns3="urn:eds:datamodel:EDS:EDS_EXTENSIONS:1">
	<Extensions>
		<ns3:SequenceNumeric>{{object.SequenceNumeric}}</ns2:SequenceNumeric>
		<ns3:Key>{{object.Key}}</ns2:Key>
		<ns3:Value>{{object.Value}}</ns2:Value>
		<ns3:DataType>{{object.DataType}}</ns2:DataType>
	</Extensions>
	<messageSender>{{object.messageSender}}</messageSender>
	<messageRecipient>{{object.messageRecipient}}</messageRecipient>
	<preparationDateAndTime>{{object.preparationDateAndTime}}</preparationDateAndTime>
	<messageIdentification>{{object.messageIdentification}}</messageIdentification>
	<messageType>{{object.messageType}}</messageType>
	<correlationIdentifier>{{object.correlationIdentifier}}</correlationIdentifier>
	<TransitOperation>
		<MRN>{{object.MRN}}</MRN>
	</TransitOperation>
	<CustomsOfficeOfDestinationActual>
		<referenceNumber>{{object.referenceNumber}}</referenceNumber>
	</CustomsOfficeOfDestinationActual>
	<TraderAtDestination>
		<identificationNumber>{{object.identificationNumber}}</identificationNumber>
	</TraderAtDestination>
    <UnloadingRemark>
		<conform>{{object.conform}}</conform>
		<unloadingCompletion>{{object.unloadingCompletion}}</unloadingCompletion>
		<unloadingDate>{{object.unloadingDate}}</unloadingDate>
		<stateOfSeals>{{object.stateOfSeals}}</stateOfSeals>
	</UnloadingRemark>
</ns4:CC044C>

<!--_______________________________________Start of AT Footer_______________________________________-->
</ns2:Msg>]]>
                </message>
                <operatorId>ReleaseTest01</operatorId>
            </arrayOfTransitRequestBean_1>
        </v01:sendMessages>
    </soapenv:Body>
</soapenv:Envelope>